# Pertemuan 11 Pandas 44
## Sumber : https://youtu.be/xDTR8XTfP40
## Menata ulang kolom pada Data Frame

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)),
                 columns = cols)
df

   A  B  C  D  E
0  2  6  7  7  1
1  6  6  1  4  6
2  6  3  5  4  3
3  1  2  9  1  4
4  6  2  7  2  6

### Menata ulang penempatan kolom pada Data Frame

In [4]:
df[['D','C','A','E','B']]

   D  C  A  E  B
0  7  7  2  1  6
1  4  1  6  6  6
2  4  5  6  3  3
3  1  9  1  4  2
4  2  7  6  6  2

penataan ulang dapat memanggil dengan `df[['col1','col3','col2']]` penataan ini tidak inplace, waktu melakukan proses ini akan membuat data file baru dengan kolom baru atau kata lain tidak permanen

In [5]:
df

   A  B  C  D  E
0  2  6  7  7  1
1  6  6  1  4  6
2  6  3  5  4  3
3  1  2  9  1  4
4  6  2  7  2  6

In [6]:
df = df[['D','C','A','E','B']]
df

   D  C  A  E  B
0  7  7  2  1  6
1  4  1  6  6  6
2  4  5  6  3  3
3  1  9  1  4  2
4  2  7  6  6  2

bila ingin menentukan penataan ulang maka tinggal memanggil variable, maka penataan ulang dapat di simpan secara terus menerus atau permanen.